In [1]:
import pandas as pd

In [6]:
items = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

In [7]:
items

[{'bikes': 20, 'pants': 30, 'watches': 35},
 {'bikes': 15, 'glasses': 50, 'pants': 5, 'watches': 10}]

In [10]:
store_items = pd.DataFrame(items,index=['store 1','store 2'])
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [11]:
print(store_items)

# We access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10
()
('How many bikes are in each store:\n',          bikes
store 1     20
store 2     15)
()
('How many bikes and pants are in each store:\n',          bikes  pants
store 1     20     30
store 2     15      5)
()
('What items are in Store 1:\n',          bikes  glasses  pants  watches
store 1     20      NaN     30       35)
()
('How many bikes are in Store 2:', 15)

In [12]:
store_items['shirts'] = [15,2]
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [13]:
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [14]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [15]:
store_items = store_items.append(new_items)
store_items

/usr/local/lib/python2.7/site-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35    15.0   45.0
store 2     15     50.0      5       10     2.0    7.0
0           20      4.0     30       35     NaN    NaN

In [17]:
# We add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts  suits  new watches
store 1     20      NaN     30       35    15.0   45.0          NaN
store 2     15     50.0      5       10     2.0    7.0         10.0
0           20      4.0     30       35     NaN    NaN         35.0

In [18]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shoes  shirts  suits  new watches
store 1     20      NaN     30       35      8    15.0   45.0          NaN
store 2     15     50.0      5       10      5     2.0    7.0         10.0
0           20      4.0     30       35      0     NaN    NaN         35.0

In [19]:
store_items.pop('new watches')
store_items

         bikes  glasses  pants  watches  shoes  shirts  suits
store 1     20      NaN     30       35      8    15.0   45.0
store 2     15     50.0      5       10      5     2.0    7.0
0           20      4.0     30       35      0     NaN    NaN

In [20]:
store_items = store_items.drop(['watches', 'shoes'], axis = 1)
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
0           20      4.0     30     NaN    NaN

In [21]:
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

In [22]:
store_items

   bikes  glasses  pants  shirts  suits
0     20      4.0     30     NaN    NaN

In [23]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

   hats  glasses  pants  shirts  suits
0    20      4.0     30     NaN    NaN

In [25]:
# We change the row label from store 3 to last store
store_items = store_items.rename(index = {0: 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [26]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

In [27]:
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN